# SQLITE RAW

In [1]:
import pandas as pd
import sqlite3

Lo siguiente crea la base si no existe o la abre si existe

In [2]:
conn = sqlite3.connect('data/vbsp.db')

Para hacer algo con la conexi√≥n se usa un cursor

In [3]:
cur = conn.cursor()

In [4]:
cur.execute('''
            CREATE TABLE IF NOT EXISTS people (
                rut INTEGER PRIMARY KEY,
                name VARCHAR(255) NOT NULL,
                age INTEGER
            )
            ''')

In [6]:
cur.execute('''
            INSERT INTO people (rut, name, age) VALUES 
            (1,'Mike', 25),
            (10,'Fred', 35),
            (1230,'Ray', 12),
            (2,'Tom', 9)
            ''')

Pero hay que hacer commit para que suban a la base de datos

In [7]:
conn.commit()

### sql to pandas

In [8]:
sql = pd.read_sql_query('SELECT * from people where age > 13', conn)
df = pd.DataFrame(sql, columns=["rut", "name", "age"])

In [9]:
df

   rut  name  age
0    1  Mike   25
1   10  Fred   35

In [10]:
df.set_index('rut', inplace=True)
print (df)

     name  age
rut
1    Mike   25
10   Fred   35

### pandas to sql

In [12]:
new_df = pd.DataFrame({
    'rut': [1231313, 90290239, 54343],
    'name': ['Fox', 'Cat', 'Dog'],
    'age': [50,11,13]
})

In [14]:
new_df

        rut name  age
0   1231313  Fox   50
1  90290239  Cat   11
2     54343  Dog   13

In [16]:
new_df.to_sql('people', con=conn, if_exists='append', index=False)

3

In [17]:
sql = pd.read_sql_query('SELECT * from people', conn)
df = pd.DataFrame(sql, columns=["rut", "name", "age"])
df

        rut  name  age
0         1  Mike   25
1         2   Tom    9
2        10  Fred   35
3      1230   Ray   12
4     54343   Dog   13
5   1231313   Fox   50
6  90290239   Cat   11